#ifndef RADIXSORT_H
#define RADIXSORT_H

/************************************************************************/
/*函数名：RadixSort
/*功  能：基数排序
/*返回值：无
/************************************************************************/
void RadixSort(int *A, int *B, const int SIZE);

/************************************************************************/
/*函数名：RadixSort
/*功  能：基数排序
/*返回值：无
/************************************************************************/
void RadixSortOpt(int *A, int *B, const int SIZE);

#endif // RADIXSORT_H